Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSingleAttributes
The ReinforcementSingleAttributes class is the base attributes class for
ReinforcementSingle.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSingleAttributes.ReinforcementVisibility
Defines which bars in the group appear in drawings.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSingleAttributes.StraightEndSymbolType
Defines how the straight ends of reinforcing bars should look like.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSingleAttributes.HookedEndSymbolType
Defines how the hooked ends of reinforcing bars should look like.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSingleAttributes.#ctor
Creates a new default reinforcement attributes instance that loads standard attributes.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSingleAttributes.#ctor(System.Boolean)
Creates a new default reinforcement attributes instance without loading attributes.
SkipAttributeLoading: Can be set to any value.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSingleAttributes.#ctor(System.String)
Creates a new reinforcement attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSingleAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.